package problems;

public class MinimumWindowSubstring {
    public static void main(String[] args) {
        String input = "ADOBECODEBANC";
        String s = "ABC";

        /*
        1. Проверяем есть ли сочетание во всем стринге

        2. Убираем по одному символу с начала и проверяем

        3. Убираем по одному символу с конца и проверяем

        либо

        1. Делим стринг на равные части по длине сочетания
        2. Проверяем совпадения
        3. Делим стринг на равные части по длине сочетания + 1
        4. Проверяем совпадения

        */


    }
}
